artillery/heavy-load-test.yml
config:
  target: "http://localhost:9501"
  processor: "./heavy-processor.js"

  phases:
    - duration: 300
      arrivalRate: 500
      rampTo: 3000
      name: "Ramp Up"
    - duration: 900
      arrivalRate: 3000
      name: "Sustained Heavy Load"

scenarios:
  - name: "Heavy Transfers"
    flow:
      - function: "buildTransfer"
      - post:
          url: "/api/v1/transactions/transfer"
          json: "{{ $json }}"
          expect:
            - statusCode:
                - 200
                - 201